# -*- coding: utf-8 -*-
TEST_LEC = """ДОБРОВОЛЬСКИЙ Е.А. 
СОВРЕМЕННОЕ ВРЕДОНОСНОЕ ПО И СПОСОБЫ ЕГО ЛЕЧЕНИЯ
В данной статье рассматриваются некоторые современные угрозы в Глобальной сети Интернет и способы борьбы с ними.
Ключевые слова: вредоносное ПО, информационная безопасность, заражение, Интернет, лечение, антивирус.
Перед обсуждением темы вредоносного ПО введем термин «Вредоносное ПО».
Вредоносное программное обеспечение (Вредоносное ПО) – это компьютерные программы или скрипты, разработанные с целью нанесения вреда компьютерной системе, пользователю или его данным. Вредоносное ПО может иметь различные формы, такие как вирусы, черви, троянские программы, шпионское ПО и руткиты. Это программы, которые скрываются внутри легитимного программного обеспечения и выполняют свои функции без согласия или знания пользователя. Основные цели вредоносного ПО включают кражу личной информации, вмешательство в работу компьютера или его сети, открывая доступ злоумышленникам к пользовательским данным, управление компьютером издалека для осуществления массовых атак или использование компьютера в качестве части ботнета. Вредоносное ПО представляет серьезную угрозу для информационной безопасности и может иметь разрушительные последствия для отдельных пользователей, предприятий и других организаций.
Теперь, когда вы ознакомились с основным понятием, можно приступать к нашей с вами теме.
Для начала введем перечень современного вредоносного ПО:
•	Вредоносные программы-вымогатели (ransomware): это вирусы, которые зашифровывают данные на компьютере жертвы и требуют выкуп за их восстановление. Они часто распространяются через вредоносные ссылки, электронные письма или поддельные загрузки. 
•	Ботнеты: Ботнеты представляют собой сети зараженных компьютеров, которые контролируются киберпреступниками. Они могут использоваться для отправки спама, совершения DDoS-атак или майнинга криптовалюты. 
•	Троянские программы: это программа, которая маскируется под полезное приложение или файл, но на самом деле содержит вредоносный код. Они могут использоваться для получения неправомерного доступа к компьютеру, кражи личной информации или установки других вредоносных программ. 
•	Кейлоггеры: Кейлоггеры следят за нажатиями клавиш на компьютере и записывают введенные данные, такие как пароли, логины или банковские данные. Эти данные могут быть злоупотребены злоумышленниками. 
•	Фишинговые атаки: Фишинг - это метод, при котором злоумышленники пытаются получить личную информацию, такую как пароли или данные кредитных карт, путем маскировки под надежные организации или сервисы. Это может происходить через электронную почту, социальные сети или вредоносные веб-сайты. 
•	Adware: Adware (рекламное ПО) это вредоносная программа, которая отображает нежелательную рекламу на компьютере пользователя. Они могут проникать на компьютер через бесплатное программное обеспечение или загрузки с ненадежных источников. 
•	Спамеры: Спамеры генерируют и отправляют массовые нежелательные электронные письма на адреса получателей. Они могут быть использованы для рассылки рекламы, распространения вирусов или фишинговых атак. 
•	Банковские трояны: это вредоносный код, который нацелен на банковскую информацию и пытается получить доступ к аккаунтам и паролям пользователей. Они могут использоваться для кражи денег или конфиденциальной информации. 
"""


LEC_2 = """ПЕРВОБЫТНЫЙ МИР И ДРЕВНЕЙШИЕ ЦИВИЛИЗАЦИИ 1.1.Антопогенез. Происхождение человека, 
его расселение по земному шару. Первобытная эпоха охватывает период в миллионы лет - от 
появления предков современного человека до III-I тысячелетий до н.э. Согласно данным, 
полученным учеными, процесс формирования семейства древних человекообразных обезьян 
начался еще 45 млн. лет назад в тропических и экваториальных районах Африки и Азии. Затем, 5-6 
млн. лет назад, здесь же появились представители австралопитеков - "обезьянолюдей", которые 
являли собой переходные формы от древних человекообразных обезьян к древнейшим людям —
архантропам. В течение многих сотен тысяч лет австралопитеки и архантропы существовали 
одновременно. Об этом убедительно свидетельствуют потрясшие весь ученый мир находки 
английского антрополога и археолога Луиса Лики, сделанные им в Кении, в Олдувайском ущелье, 
расположенном в зоне Великого Африканского рифта. Они доказали, во-первых, что древний 
человек появился примерно 2,5 млн. лет назад, т.е. значительно раньше, чем предполагалось до 
этого, и, во-вторых, что его прародиной была именно Африка. Ему дали видовое название —
"человек умелый" (HomoHabilis). С течением времени этот человек постепенно 
трансформировался в "человека прямоходящего" (Homoerectus). 600-700 тыс. лет назад началась 
постепенная смена архантропов другими древнейшими людьми - питекантропами, синантропами 
и пришедшим им на смену неандертальцами, получившими собирательное наименование 
палеоантропов. Просуществовав несколько сотен тысяч лет, они явились непосредственными 
предшественниками неоантропа, т.е. "человека разумного" (Homosapiens), к роду которого 
относятся и современные люди. Ученые считают, что смена палеоантропов неоантропами —
кроманьонцами произошла примерно 30-40 тыс. лет назад. Процесс формирования людей 
современного вида принято называть сапиентацией. Первые ареалы возникновения первобытных 
людей находились в пределах экваториального и тропического поясов Африки и Азии. Отсюда 
началось их расселение по Земле. В Африке становление древнейшего человека произошло 
главным образом в зоне травянистой саванны. Затем люди распространились почти по всему 
континенту. Около миллиона лет назад африканские архантропы продвинулись за пределы 
тропического и экваториального районов в северном направлении и проникли на территорию 
умеренного пояса Европы. Поздние их потомки - палеоантропы - расселились уже по большей 
части Европы. В Азии основные ареалы зарождения первобытных людей находились в пределах 
Зондских островов (питекантропы), Индии, Китая (отсюда название "синантроп" - китайский 
человек). Со временем они также подверглись расширению. Относительно заселения Америки 
ученые высказывали две точки зрения. Некоторые из них считали, что население ее автохтонно, 
т.е. является коренным, первоначальным населением, другие утверждали, что оно пришло из 
Азии. Со временем победила вторая точка зрения. И в самом деле, до сих пор в Новом Свете не 
найдено останков человекообразных обезьян. К тому же по своему антропологическому типу 
коренное население Америки явно близко к монголоидам. Согласно современным 
представлениям, древние переселенцы из Азии перешли через узкий в то время Берингов пролив 
либо по льду, либо по перешейку и оказались на Аляске. Это произошло, по одним данным, 
примерно 30-40, по другим - 12-15 тыс. лет назад. В дальнейшем пришельцы продвинулись 
сначала до Калифорнии, затем дошли до Панамского перешейка и к концу палеолита — до 
Огненной Земли, преодолев на своем пути многочисленные горные хребты, реки, лесные 
массивы и пустыни. Но есть и другие гипотезы заселения Америки, которые подтверждаются 
некоторыми последними археологическими открытиями. Подобные же гипотезы существовали и 
в отношении заселения Австралии. После открытия этого материка долгое время считалось, что 
местные аборигены являются его автохтонными жителями. И только в ХХв. было доказано, что 
люди впервые пришли сюда из Юго-Восточной Азии предположительно 35-40 тыс. лет назад. Эта 
миграция оказалась не такой уж сложной, поскольку уровень Мирового океана был тогда ниже и 
острова Малайского и Зондского архипелагов, по существу, составляли с Австралией единое целое 
(как, впрочем, и Тасмания). В пользу такой версии говорит и то, что в Австралии никогда не было 
человекообразных обезьян. Да и останков архантропов и палеоантропов здесь до недавнего 
времени никто не находил. Заселение Океании также, по-видимому, произошло в глубокой 
древности. Под давлением монголоидов, нахлынувших с севера, часть населения Южной Азии 
переместилась в Океанию, образовав там новый антропологический тип. При этом сначала была 
освоена Меланезия (на Новой Гвинее человек появился примерно 30 тыс. лет назад), затем 
Полинезия и Микронезия. В результате можно утверждать, что к концу палеолита, т.е.примерно 
за 10 тыс. лет до нашей эры, все материки — кроме, разумеется, Антарктиды - были уже в той или 
иной мере заселены. Приспособившись к экстремальным условиям существования, человек стал 
обитать во всех природных зонах. Такому быстрому расселению людей способствовало 
понижение уровня Мирового океана примерно на 100 м, связанное прежде всего с консервацией 
большого количества влаги в ледниках, площади которых в эпоху оледенения сильно 
увеличились. В свою очередь это привело к осушению морских мелководий и появлению 
сухопутных переходов между материками. Какой же ареал или географический регион следует 
считать в таком случае прародиной современного человечества? Одни ученые полагают, что таких 
ареалов существовало несколько, прежде всего в Африке и в Азии; эту теорию обычно называют 
теорией полицентризма. По мнению сторонников другой, моноцентрической теории, решающую 
роль сыграл один ареал. На начальном этапе формирования человека, во время раннего 
палеолита, предки современного человека, как полагают многие исследователи, жили в составе 
так называемого первобытного стада. Затем постепенно возник род, или кровнородственная 
первобытная община. Несколько родов составляли племя. Зародилось и половозрастное 
разделение труда, при котором женщины занимались собирательством и ведением домашнего 
хозяйства, молодые мужчины - охотой, а старики - изготовлением орудий труда. В период 
преобладания собирательства во главе такого рода (общины) обычно стояла женщина, которая 
была не только продолжа тельницей рода, но и играла главную роль в добывании средств к 
существованию. По мере того как возрастало значение охоты, а тем более земледелия и 
скотоводства, ведущая роль стала переходить к мужчине. Так матриархат сменился патриархатом, 
большесемейной отцовской общиной. 1.2. Социальный строй, занятия и культура первобытного 
общества. Вся жизнь первобытных людей приходится на период каменного века, который начался 
около 2,5 млн. лет назад, а закончился за 3 тыс. лет до н.э. С каменным веком связано начало 
обработки природных материалов, т.е. зарождение собственно материальной культуры, в 
процессе развития которой происходила и "обработка" самого человека. Эволюция материальной 
культуры каменного века изучена достаточно хорошо. Уже в древнем каменном веке, или 
палеолите (греч. palaios — древний и lithos — камень), который закончился лишь за 12 тыс. лет до 
н.э., люди научились использовать для производства орудий труда камень, кость и дерево, но 
преобладали изделия из камня. Сначала это были грубые каменные ручные рубила, затем 
появились каменные ножи, топоры, молотки, скребки, остроконечники. К концу палеолита 
произошло дальнейшее усовершенствование каменных (кремниевых) орудий, их научились 
насаживать на деревянную рукоятку. Предметами охоты стали такие крупные животные, как 
мамонт, пещерный медведь, бык, северный олень. Люди научились строить более или менее 
постоянные поселения, примитивные жилища, укрываться в естественных пещерах. Огромную 
роль сыграло произошедшее примерно 60 тыс. лет назад овладение огнем, который добывался 
трением двух кусков древесины. Это впервые дало людям господство над определенной силой 
природы и тем самым окончательно вырвало их из мира животных. Только благодаря обладанию 
огнем человеку удалось заселить обширные территории в умеренном поясе и выжить в условиях 
сурового ледникового периода. Палеолит сменился сравнительно короткой эпохой мезолита, или 
среднего каменного века (12-8 тыс. лет до н.э.). В мезолите происходило дальнейшее 
совершенствование каменных орудий. Были также изобретены и получили широкое 
распространение лук и стрелы, что намного увеличило эффективность охоты на лесных зверей. 
Для рыболовства начали использовать гарпуны и сети. Еще большие изменения в материальной 
культуре произошли с настулением неолита, или нового каменного века, за 8 тыс. лет до н.э. В эту 
эпоху появились шлифовальные, сверлильные и другие сложные каменные орудия, гончарные 
изделия, простейшие ткани. В качестве первого земледельческого орудия стали применять 
простую копательную палку, а затем и мотыгу, которая в усовершенствованном виде дошла до 
наших дней. Был создан деревянный серп с кремниевой насадкой. В тропических лесах началось 
подвижное подсечно-огневое земледелие, также сохранившееся до наших дней. Наиболее 
древним видом хозяйственной деятельности первобытных людей было собирательство. Ведя 
стадный, полукочевой образ жизни, они питались растениями, плодами, кореньями. Чтобы 
прокормиться, человек-собиратель должен был иметь кормовую территорию размером более 
500 га, т.е. проходить в сутки 25-30 км. Но постепенно, оттесняя собирательство, на первый план 
стала все более выдвигаться охота сначала на мелких, а потом и на крупных животных. Активная 
охота во многом изменила жизнедеятельность древних людей. Она же сделала их из 
вегетарианцев всеядными. Наряду с охотой стало развиваться и рыболовство. И только в самом 
конце первобытной эпохи, в эпоху неолита, начался переход от присваивающих форм хозяйства к 
производящим. Он нашел свое выражение в зарождении примитивного земледелия и 
скотоводства. Этот процесс получил название неолитической революции. 1.3. Неолитическая 
революция и ее последствия Неолитической революцией (понятие введено в научный оборот 
Гордоном Чайлдом в середине XX в.) называют грандиозный социально-экономический 
переворот, заключавшийся в широком перехоле от присваивающей экономики к производящей, 
от охоты и собирательства к земледелию и скотоводству. Этот период был очень длительным: в 
Старом Свете он занял 2-3, а в Новом Свете даже 3-4 тыс. лет. Достигшее совершенства 
присваивающее хозяйство привело к обеднению окружающей среды биологическими ресурсами, 
прежде всего к обеднению дичью, охотничьей добычей, то есть возник экологический кризис 
(истощение запасов дичи и полезных растений). У людей возникла необходимость 
восстановления биологических ресурсов и прогнозирование их объемов. Постепенный переход к 
земледелию и скотоводству позволил постоянно восполнять путем воспроизводства скудеющие 
биологические ресурсы окружающей среды. Хотя люди и продолжали заниматься охотой и 
собирательством, однако их доля в общем объеме пищи постепенно стала снижаться за счет роста 
объемов произодящего хозяйства. Первые земледельцы рыхлили землю мотыгами. Позднее 
стали использовать для этого животных: быков запрягали в соху и с их помощью пахали землю. 
Это были уже прирученные животные, а не дикие стада, вытаптывавшие посевы первых 
земледельцев. Первобытные люди стали постепенно приручать детенышей диких овец, коз, 
свиней, быков, ослов, отдавая им на корм часть своего урожая, приспосабливая их к жизни с 
людьми и делая полезными в хозяйстве. Так 8-9 тыс. лет назад появилось скотоводство. Самые 
древние поселения земледельцев археологи обнаружили в Передней Азии (это земли Турции, 
Ирана, Ирака, Палестины). И сейчас там можно найти дикие пшеницу, ячмень, рожь, овес. А 
раньше там водились предки современных ручных животных: дикий осел (кулан), дикий баран 
(муфлон), дикий бык (тур). В других районах Земли первые земледельцы выращивали другие 
полезные растения: фасоль и кукурузу - в Центральной Америке, картофель - в Южной Америке, 
бананы и сахарный тростник - в Индии, просо и рис — в Китае. Неолитическая революция 
позволила первобытному человеку производить больше продовольствия. Занимаясь 
земледелием и скотоводством первобытные люди уже не испытывали угрозы смерти от голода, 
поэтому их численность стала быстро расти."""
